---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationEndSize
source: html/125ba632-18a8-c6e5-e13e-6bb1390131db.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationEndSize Property

"Size of Connector End"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationEndSize { get; }
```